# ConnectorSet Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectorSet Constructor
ConnectorSet Class See Also
---
Initializes a new instance of the ConnectorSet class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ConnectorSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ConnectorSet()
```

# See Also
ConnectorSet Class
Autodesk.Revit.DB Namespace